{"format": "graph-model", "generatedBy": "2.17.1", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"input": {"name": "input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "256"}, {"size": "256"}, {"size": "3"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "6"}]}}}}, "modelTopology": {"node": [{"name": "PartitionedCall/model_2/tf.__operators__.add/AddV2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/model_2/tf.compat.v1.gather/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_2/tf.reshape_1/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_5", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_6", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_2/tf.compat.v1.transpose/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_2/tf.reshape/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_2/tf.__operators__.add_1/AddV2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/model_2/tf.compat.v1.gather_1/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_2/tf.reshape_2/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_2/tf.concat_2/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_2/flatten/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_2/flatten/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_2/flatten/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_2/flatten/Reshape/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_11", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2304"}, {"size": "2304"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_13", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2304"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_14", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2304"}, {"size": "6"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_16", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "6"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "256"}, {"size": "256"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_2/tf.math.add/Add", "op": "_FusedConv2D", "input": ["input", "unknown", "unknown_0"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/model_2/tf.nn.leaky_relu/LeakyRelu", "op": "_FusedConv2D", "input": ["PartitionedCall/model_2/tf.math.add/Add", "unknown_1", "unknown_2"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.01}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/model_2/tf.compat.v1.nn.pool/max_pool", "op": "MaxPool", "input": ["PartitionedCall/model_2/tf.nn.leaky_relu/LeakyRelu"], "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "3", "3", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/model_2/tf.math.add_2/Add", "op": "_FusedConv2D", "input": ["PartitionedCall/model_2/tf.compat.v1.nn.pool/max_pool", "unknown_3", "unknown_4"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/model_2/tf.nn.leaky_relu_1/LeakyRelu", "op": "_FusedConv2D", "input": ["PartitionedCall/model_2/tf.math.add_2/Add", "unknown_5", "unknown_6"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.01}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/model_2/tf.compat.v1.nn.pool_1/max_pool", "op": "MaxPool", "input": ["PartitionedCall/model_2/tf.nn.leaky_relu_1/LeakyRelu"], "attr": {"ksize": {"list": {"i": ["1", "3", "3", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/model_2/tf.nn.max_pool2d/MaxPool2d", "op": "MaxPool", "input": ["PartitionedCall/model_2/tf.compat.v1.nn.pool_1/max_pool"], "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "42", "42", "1"]}}, "strides": {"list": {"i": ["1", "42", "42", "1"]}}}}, {"name": "PartitionedCall/model_2/tf.compat.v1.transpose/transpose", "op": "Transpose", "input": ["PartitionedCall/model_2/tf.nn.max_pool2d/MaxPool2d", "PartitionedCall/model_2/tf.compat.v1.transpose/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_2/tf.reshape/Reshape", "op": "Reshape", "input": ["PartitionedCall/model_2/tf.compat.v1.transpose/transpose", "PartitionedCall/model_2/tf.reshape/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_2/tf.compat.v1.shape/wa/Shape", "op": "Shape", "input": ["PartitionedCall/model_2/tf.reshape/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT64"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT64"}]}]}}, {"name": "PartitionedCall/model_2/tf.compat.v1.shape_1/wa/Shape_1", "op": "Shape", "input": ["PartitionedCall/model_2/tf.reshape/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT64"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT64"}]}]}}, {"name": "PartitionedCall/model_2/tf.compat.v1.gather/GatherV2", "op": "GatherV2", "input": ["PartitionedCall/model_2/tf.compat.v1.shape/wa/Shape", "PartitionedCall/model_2/tf.__operators__.add/AddV2", "PartitionedCall/model_2/tf.compat.v1.gather/GatherV2/axis"], "attr": {"Tparams": {"type": "DT_INT64"}, "Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT64"}, "batch_dims": {"i": "0"}}}, {"name": "PartitionedCall/model_2/tf.compat.v1.gather_1/GatherV2", "op": "GatherV2", "input": ["PartitionedCall/model_2/tf.compat.v1.shape_1/wa/Shape_1", "PartitionedCall/model_2/tf.__operators__.add_1/AddV2", "PartitionedCall/model_2/tf.compat.v1.gather_1/GatherV2/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT64"}, "Tindices": {"type": "DT_INT64"}, "batch_dims": {"i": "0"}}}, {"name": "PartitionedCall/model_2/tf.reshape_1/Reshape", "op": "Reshape", "input": ["PartitionedCall/model_2/tf.compat.v1.gather/GatherV2", "PartitionedCall/model_2/tf.reshape_1/Reshape/shape"], "attr": {"T": {"type": "DT_INT64"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_2/tf.reshape_2/Reshape", "op": "Reshape", "input": ["PartitionedCall/model_2/tf.compat.v1.gather_1/GatherV2", "PartitionedCall/model_2/tf.reshape_2/Reshape/shape"], "attr": {"T": {"type": "DT_INT64"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_2/tf.concat_2/concat", "op": "ConcatV2", "input": ["PartitionedCall/model_2/tf.reshape_1/Reshape", "PartitionedCall/model_2/tf.reshape_2/Reshape", "PartitionedCall/model_2/tf.concat_2/concat/axis"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT64"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_2/tf.reshape_3/Reshape", "op": "Reshape", "input": ["PartitionedCall/model_2/tf.reshape/Reshape", "PartitionedCall/model_2/tf.concat_2/concat"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/model_2/flatten/Shape", "op": "Shape", "input": ["PartitionedCall/model_2/tf.reshape_3/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "PartitionedCall/model_2/flatten/strided_slice", "op": "StridedSlice", "input": ["PartitionedCall/model_2/flatten/Shape", "PartitionedCall/model_2/flatten/strided_slice/stack", "PartitionedCall/model_2/flatten/strided_slice/stack_1", "PartitionedCall/model_2/flatten/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "PartitionedCall/model_2/flatten/Reshape/shape", "op": "Pack", "input": ["PartitionedCall/model_2/flatten/strided_slice", "PartitionedCall/model_2/flatten/Reshape/shape/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_2/flatten/Reshape", "op": "Reshape", "input": ["PartitionedCall/model_2/tf.reshape_3/Reshape", "PartitionedCall/model_2/flatten/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_2/tf.nn.leaky_relu_2/LeakyRelu", "op": "_FusedMatMul", "input": ["PartitionedCall/model_2/flatten/Reshape", "unknown_11", "unknown_13"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.01}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_2/output/AddV2", "op": "_FusedMatMul", "input": ["PartitionedCall/model_2/tf.nn.leaky_relu_2/LeakyRelu", "unknown_14", "unknown_16"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["PartitionedCall/model_2/output/AddV2"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1994}}, "weightsManifest": [{"paths": ["group1-shard1of6.bin", "group1-shard2of6.bin", "group1-shard3of6.bin", "group1-shard4of6.bin", "group1-shard5of6.bin", "group1-shard6of6.bin"], "weights": [{"name": "PartitionedCall/model_2/tf.__operators__.add/AddV2", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/model_2/tf.compat.v1.gather/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/model_2/tf.reshape_1/Reshape/shape", "shape": [1], "dtype": "int32"}, {"name": "unknown", "shape": [3, 3, 3, 64], "dtype": "float32"}, {"name": "unknown_0", "shape": [64], "dtype": "float32"}, {"name": "unknown_1", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "unknown_2", "shape": [128], "dtype": "float32"}, {"name": "unknown_3", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "unknown_4", "shape": [128], "dtype": "float32"}, {"name": "unknown_5", "shape": [3, 3, 128, 64], "dtype": "float32"}, {"name": "unknown_6", "shape": [64], "dtype": "float32"}, {"name": "PartitionedCall/model_2/tf.compat.v1.transpose/transpose/perm", "shape": [4], "dtype": "int32"}, {"name": "PartitionedCall/model_2/tf.reshape/Reshape/shape", "shape": [2], "dtype": "int32"}, {"name": "PartitionedCall/model_2/tf.__operators__.add_1/AddV2", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/model_2/tf.compat.v1.gather_1/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/model_2/tf.reshape_2/Reshape/shape", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/model_2/tf.concat_2/concat/axis", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/model_2/flatten/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/model_2/flatten/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/model_2/flatten/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/model_2/flatten/Reshape/shape/1", "shape": [], "dtype": "int32"}, {"name": "unknown_11", "shape": [2304, 2304], "dtype": "float32"}, {"name": "unknown_13", "shape": [2304], "dtype": "float32"}, {"name": "unknown_14", "shape": [2304, 6], "dtype": "float32"}, {"name": "unknown_16", "shape": [6], "dtype": "float32"}]}]}